/*
    유클리드 호제법을 이용하여 최대 공약수 구하기

    Q) 1071과 1029의 최대공약수를 구해보자
    A)
    두 수가 나누어 떨어질 때까지 나누기를 반복한다.
    1071/1029=XX...42
    1029/42=XX...21
    42/21=2...0 --> 42는 21로 나누어 떨어지므로 '21'이 최대공약수이다.

    function getGCD(a,b) {
        if(b==0) return a;
        return getGCD(b, a%b);
    }
*/

/*
    [기약 분수]
    분수로 표현된 분자와 분모가 1 이외의 공통된 약수로 더 이상 나누어 떨어지지 않는 형태가 된 것을 말한다
    (약분이 더이상 되지 않는 분수)
    정수 a, b에 대해 분수 a/b가 기약 분수라는 것은 a,b가 서로 소,
    즉 최대공약수가 1이라는 것은 같은 말이다.
*/

function getGCD(a,b) {
    return b==0 ? a : getGCD(b, a%b);
}

function solution(a, b) {
    //1. 최대 공약수 구하기
    let gcd = getGCD(a,b);

    //2. 분모를 최대공약수로 나누기
    b/=gcd;

    //3. 분모에 2와 5만 남도록
    while(b%2===0) b/=2;
    while(b%5===0) b/=5;

    return b===1 ? 1 : 2;
}